
# print('%s님의 나이는 %d입니다.' % ('김변수', 39))
# print('{}님의 나이는 {}입니다.'.format('이상수', 29))
# print('%s님의 몸무게는 %f입니다.' % ('김변수', 77.7))
# print('{}님의 나이는 {:f}입니다.'.format('이상수', 66.6))
# print('%s님의 몸무게는 %.2f입니다.' % ('김변수', 77.7))
# print('{}님의 나이는 {:.1f}입니다.'.format('이상수', 66.6))

# print('%10d원' % (1000))
# print('%10d원' % (100000))
# print('{:10}원'.format(100000))
# print('{:10}원'.format(10000000))

# print('%10s, %-10s' % ('오른쪽', '왼쪽'))
# print('{:>10}, {:<10}' .format('오른쪽', '왼쪽'))
# print('{:^10}'.format('가운데'))

print('%5d %05d' % (10, 123))
print('{:5} {:05}'.format(100, 12))
print('{:,}'.format(10000000))