print("Hello world!")
print('Hello world!')

print('3 더하기 20 :' , 3 + 20 ,"입니다.")
print('3 빼기 20 :',3 - 20 , '입니다.')
print(3 * 20)
print(20 / 3)
print(20 % 3)

print("저의 이름은 홍길동입니다.")
print("저의 나이는 20살 입니다.")
print("주소는 산골자기입니다.")
#ctrl + shift + art 그다음에 방향키
'''
동시에 똑같은 줄을 편집하려면 ctrl + shift + art 다음에 방향키를 누르면
동시에 편집을 할 수 있게 된다.

+art를 누른채로 마우스 커서로 입력할곳을 누르는것 또한 이렇게 사용할 수 있다.
'''

print('\n12 + 54 =',12+54,'입니다.')
print('268 - 41 =',268 - 41,'입니다.')
print('2 * 23 =',2 * 23,'입니다.')
print('120 / 3 =',120 / 3,'입니다.')


