s = """"그리스","남자","15~19세",3.37341,5.59579,39.7152
"그리스","남자","15~24세",15.91255,23.94037,33.53255
"그리스","남자","15~64세",65.89341,76.70061,14.09011
"그리스","남자","20~24세",29.26001,43.4675,32.68532
"그리스","남자","25~29세",67.09635,86.86536,22.75821
"그리스","남자","25~34세",73.60133,91.04733,19.16147
"그리스","남자","25~54세",80.77461,93.1843,13.31736
"그리스","남자","25~64세",75.06056,86.37753,13.10176
"그리스","남자","30~34세",79.86344,95.07318,15.99793
"그리스","남자","35~39세",84.49732,95.61999,11.63216
"그리스","남자","35~44세",84.71254,95.41642,11.21806
"그리스","남자","40~44세",84.89713,95.24183,10.8615
"그리스","남자","45~49세",84.27069,94.69062,11.00418
"그리스","남자","45~54세",82.39917,92.61348,11.02896
"그리스","남자","50~54세",80.63156,90.65165,11.0534
"그리스","남자","55~59세",69.45743,78.57276,11.60113
"그리스","남자","55~64세",56.12744,63.82377,12.05873
"그리스","남자","60~64세",43.38704,49.72714,12.74978
"그리스","남자","65~69세",16.0497,18.04859,11.07503"""
s = s.split("\n")
ss = []
for i in range(len(s)) :
    ss.append(s[i].split(','))
print(ss)
print("\n\n\n")
temp = ''
for i in range(len(ss)) :
    for j in range(len(ss[i])) :
        if not temp == ss[i][2] :
            print("{}".format(ss[i][2]),end=",")
            temp = ss[i][2]
print("\n\n\n")




s = """
그리스
네덜란드
노르웨이
뉴질랜드
덴마크
독일
라트비아
러시아
룩셈부르크
리투아니아
멕시코
미국
벨기에
스웨덴
스위스
스페인
슬로바키아
슬로베니아
아이슬란드
아일랜드
에스토니아
영국
오스트레일리아
오스트리아
이스라엘
이탈리아
일본
체코
칠레
캐나다
콜롬비아
터키
포르투갈
폴란드
프랑스
핀란드
한국
헝가리"""
s = s.strip()
s = s.split("\n")
for i in range(0,len(s)) :
    print("'"+s[i]+"'",end="")
    print(",",end="")

country = ['그리스','네덜란드','노르웨이','뉴질랜드','덴마크','독일','라트비아','러시아','룩셈부르크','리투아니아','멕시코','미국','벨기에','스웨덴','스위스','스페인','슬로바키아','아이슬란드','아일랜드','에스토니아','영국','오스트레일리아','오스트리 아','이스라엘','이탈리아','일본','체코','칠레','캐나다','콜롬비아','터키','포르투갈','폴란드','프랑스','핀란드','한국','헝가리']
print("\n\n\n")
for i in range(0,len(country)) :
    if country[i] == '한국' :
        print("i :",i)
kn = "한국(남한)"
if str(kn) == "한국(남한)" :
    print("남한이 맞습니다.")
print("\n\n\n")
b = "ghdwpa0k0s0ghdws0a0k0s"
print(len(b))
def remove_zero(string) :
    temp_string = list(string)
    i = 0
    while True :
        i += 1
        if i < len(temp_string):
            if temp_string[i] == '0' :
                del temp_string[i]
        else :
            break
    string = ''.join(temp_string)
    return string
b = remove_zero(b)
print("b =",b)
print(type(b))
print(b[0])

a = """['ghd':wpaks]['ghd':wpaks]['ghd':wpaks]['ghd':wpaks]"""
print(a)
b = print(a)
print(b)
for i in range(len(a)) :
    print(a[i],end='')
    if a[i] == "]" :
        print("")
